tests/doctor/onboarding/stress/artillery-login-stress.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 30
      name: "Doctor Login Stress Test"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Doctor Login Load Test"
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "doctor{{ $randomInt(0, 9) }}@example.com"
            password: "password123"
          expect:
            - statusCode: 200